ch32-riscv-ug/CH32V20x/EVT_205/EXAM/QSPI/QSPI_FLASH/User/main.c
    QSPI_SetAddress(QSPI1, addr);
    QSPI_SetDataLength(QSPI1, len);

    QSPI_EnableQuad(QSPI1, ENABLE);
    QSPI_Start(QSPI1);

    QSPI_Receive(data, len);

    QSPI_ClearFlag(QSPI1, QSPI_FLAG_FT);
    QSPI_ClearFlag(QSPI1, QSPI_FLAG_TC);
    QSPI_EnableQuad(QSPI1, DISABLE);
}

/*********************************************************************
 * @fn      Buffer_Cmp
 * 
 * @brief   Compare two buffers
 * 
 * @param   buf1 - the first buffer
 *          buf2 - the second buffer
 *          len - the length of the buffers
 * 
 * @return  the index of the first different byte, or -1 if the buffers are identical
 */
int32_t Buffer_Cmp(uint8_t* buf1, uint8_t* buf2, uint32_t len)
{
    uint32_t res = -1;
    for (int i = 0; i < len; i++)
    {
        if (buf1[i] != buf2[i])
        {
            res = i;
            break;
        }
    }
    return res;
}

/*********************************************************************
 * @fn      Print_Buffer
 * 
 * @brief   Print a buffer
 * 
 * @param   buf - the buffer to print
 *          len - the length of the buffer
 * 
 * @return  none
 */
void Print_Buffer(u8* buf, u32 len)
{
    for (uint32_t i = 0; i < len; i++)
    {
        printf("%02x ", buf[i]);
        if ((i + 1) % 16 == 0)
        {
            printf("\n");
        }
    }
    printf("\nEND\n");
}

/*********************************************************************
 * @fn      Write_Test_Data
 * 
 * @brief   Write test data to the QSPI in 4 lines mode
 * 
 * @param   write_page_count - the number of pages to write
 * 
 * @return  none
 */
void Write_Test_Data(uint32_t write_page_count)
{
    const uint32_t max_count = write_page_count * 256;

    uint32_t count = 0;
    while (count < max_count)
    {
        uint32_t* wr = (uint32_t*)writeBuffer;
        for (size_t t = 0; t < 256 / 4; t++)
        {
            *wr = count;
            wr++;
            count++;
        }
        uint32_t addr = (count * 4) - 256;
        if (addr % 4096 == 0)
        {
            QSPI_EraseSector(addr);
            printf("erase sector %x\n", addr);
        }
        QSPI_ProgramPageQuad(addr, writeBuffer, 256);
        printf("write page %x\n", addr);
    }
}

/*********************************************************************
 * @fn      Hardware
 * 
 * @brief   Main function
 * 
 * @return  none
 */
int main()
{

    SystemCoreClockUpdate();
    Delay_Init();
    USART_Printf_Init(115200);
    printf("SystemClk:%d\r\n", SystemCoreClock);
    printf("ChipID:%08x\r\n", DBGMCU_GetCHIPID());
    printf("QSPI TEST\n");

    GPIO_Config();
    QSPI1_Config();

    QSPI_Cmd(QSPI1, ENABLE);

    QSPI_WriteCmd(FLASH_CMD_EnableReset);
    QSPI_WriteCmd(FLASH_CMD_ResetDevice);
    Delay_Us(100);
    QSPI_WaitForBsy();

    printf("GetManufacturerID %x\n", QSPI_GetManufacturerID());
    printf("GetManufacturerID_DualIO %x\n", QSPI_GetManufacturerID_DualIO());
    printf("GetManufacturerID_QuadIO %x\n", QSPI_GetManufacturerID_QuadIO());
    printf("sr1 %x\n", QSPI_ReadSR(FLASH_CMD_ReadStatus_REG1));
    printf("sr2 %x\n", QSPI_ReadSR(FLASH_CMD_ReadStatus_REG2));

    const uint32_t rd_addr = 0x50000;
    const uint32_t rd_len  = 256;
    int32_t        res     = 0;

    printf("one line read\n");
    QSPI_GetData(rd_addr, verifyBuffer, rd_len);
    Print_Buffer(verifyBuffer, rd_len);
    Delay_Ms(1);

    printf("DualIO read\n");
    memset(readBuffer, 0, rd_len);
    QSPI_GetData_DualIO(rd_addr, readBuffer, rd_len);

    res = Buffer_Cmp(verifyBuffer, readBuffer, rd_len);

    if (res != -1)
    {
        printf("DualIO read error %d\n", res);
        Print_Buffer(readBuffer, rd_len);
    }
    else
    {
        printf("DualIO read success\n");
    }

    printf("QuadIO read\n");
    memset(readBuffer, 0, rd_len);
    QSPI_GetData_QuadIO(rd_addr, readBuffer, rd_len);
    res = Buffer_Cmp(verifyBuffer, readBuffer, rd_len);

    if (res != -1)
    {
        printf("QuadIO read error %d\n", res);
        Print_Buffer(readBuffer, rd_len);
    }
    else
    {
        printf("QuadIO read success\n");
    }

    printf("read test and verify end\n");

 
    while (1)
    {
    }
}
